export type Initial = keyof typeof Initials
export type Final = keyof typeof Finals

/** 声母，老派，《长沙话音档》, 23 个 */
export const Initials = {
  '': '', // 屋羊影幼入
  p: 'p', // 布步波婆笔薄
  pʰ: 'pʰ', // 批怕拼跑拔憋 pʻ
  m: 'm', // 眉秒茂门密莫
  f: 'f', // 府虎飞花福法
  t: 't', // 低题多驼答德
  tʰ: 'tʰ', // 天土套拖脱铁 tʻ
  l: 'l', // 老脑兰南力落
  ts: 'ts', // 资瓷渣茶集桌 ts/ʦ
  tsʰ: 'tsʰ', // 此搓菜枪族插 tsʻ/ʦʻ
  s: 's', // 送孙所笑色索
  tʂ: 'tʂ', // 真诚招潮折竹
  tʂʰ: 'tʂʰ', // 昌秤齿车浊尺 tʂʻ
  ʂ: 'ʂ', // 身常手社食叔
  ʐ: 'ʐ', // 人忍认日肉
  tɕ: 'tɕ', // 鸡骑猪除局决, tɕ/ʨ
  tɕʰ: 'tɕʰ', // 起气丘巧出杰, tɕʰ
  ȵ: 'ȵ', // 泥义女年弱业
  ɕ: 'ɕ', // 希贤向香学说
  k: 'k', // 关狂龟葵谷各
  kʰ: 'kʰ', // 开考扣宽阔客 kʻ
  ŋ: 'ŋ', // 欧熬藕傲握压
  x: 'x', // 欢红很唤活黑
} as const

/** 韵母，老派，《长沙话音档》, 41 个 */
export const Finals = {
  ɿ: 'ɿ', // 姿字刺事紫师
  i: 'i', // 梯比奇取地漆
  u: 'u', // 姑佛普布伏裤
  y: 'y', // 举煮巨书屈出
  ʅ: 'ʅ', // 知治纸滞时诗
  a: 'a', // 沙爬打骂法稗
  ia: 'ia', // 佳家提霞喫滴
  ua: 'ua', // 瓜挂夸瓦刮滑
  ya: 'ya', // 抓瘸爪踹刷耍
  o: 'o', // 坡歌母多脱坐
  io: 'io', // 脚学雀削略弱
  ə: 'ə', // 车蛇去白北格
  ie: 'ie', // 铁冶借些别业
  uə: 'uə', // 国
  ye: 'ye', // 月靴缺说决热
  ai: 'ai', // 胎排彩盖在鞋
  uai: 'uai', // 乖怪快块外拐
  yai: 'yai', // 衰甩帅揣转
  ei: 'ei', // 杯雷嘴醉推灰
  uei: 'uei', // 规亏跪柜胃味
  yei: 'yei', // 追锤吹水税锐
  au: 'au', // 包桃考照草胶
  iau: 'iau', // 标条小叫苗腰
  əu: 'əu', // 都绸土助走读
  iəu: 'iəu', // 丢流酒救牛秋
  õ: 'õ', // 端盘管半乱满
  ə̃: 'ə̃', // 沾缠展战善扇
  iẽ: 'iẽ', // 天棉脸线肩演
  yẽ: 'yẽ', // 专船犬怨穿传
  an: 'an', // 班谈长尚岸抗
  ian: 'ian', // 江强奖象样谅
  uan: 'uan', // 关广狂矿万黄
  yan: 'yan', // 庄床闯壮赚涮
  ən: 'ən', // 分门等寸硬恨
  in: 'in', // 兵民顶进定幸
  uən: 'uən', // 昆文捆棍问困
  yn: 'yn', // 君群准训顺刃
  oŋ: 'oŋ', // 东朋猛冻共贡
  ioŋ: 'ioŋ', // 兄穷勇嗅用镕
  m̩: 'm̩', // 姆
  n̩: 'n̩', // 你
} as const
