/** 声母，老派，《长沙话音档》, 23 个 */
export enum Initials {
  // 屋羊影幼入
  Ø = '',
  // 布步波婆笔薄
  p = 'p',
  // 批怕拼跑拔憋 pʻ
  pʰ = 'pʰ',
  // 眉秒茂门密莫
  m = 'm',
  // 府虎飞花福法
  f = 'f',
  // 低题多驼答德
  t = 't',
  // 天土套拖脱铁 tʻ
  tʰ = 'tʰ',
  // 老脑兰南力落
  l = 'l',
  // 资瓷渣茶集桌 ts/ʦ
  ts = 'ts',
  // 此搓菜枪族插 tsʻ/ʦʻ
  tsʰ = 'tsʰ',
  // 送孙所笑色索
  s = 's',
  // 真诚招潮折竹
  tʂ = 'tʂ',
  // 昌秤齿车浊尺 tʂʻ
  tʂʰ = 'tʂʰ',
  // 身常手社食叔
  ʂ = 'ʂ',
  // 人忍认日肉
  ʐ = 'ʐ',
  // 鸡骑猪除局决, tɕ/ʨ
  tɕ = 'tɕ',
  // 起气丘巧出杰, tɕʰ
  tɕʰ = 'tɕʰ',
  // 泥义女年弱业
  ȵ = 'ȵ',
  // 希贤向香学说
  ɕ = 'ɕ',
  // 关狂龟葵谷各
  k = 'k',
  // 开考扣宽阔客 kʻ
  kʰ = 'kʰ',
  // 欧熬藕傲握压
  ŋ = 'ŋ',
  // 欢红很唤活黑
  x = 'x',
}

/** 韵母，老派，《长沙话音档》, 41 个 */
export enum Finals {
  // 姿字刺事紫师
  ɿ = 'ɿ',
  // 梯比奇取地漆
  i = 'i',
  // 姑佛普布伏裤
  u = 'u',
  // 举煮巨书屈出
  y = 'y',
  // 知治纸滞时诗
  ʅ = 'ʅ',
  // 沙爬打骂法稗
  a = 'a',
  // 佳家提霞喫滴
  ia = 'ia',
  // 瓜挂夸瓦刮滑
  ua = 'ua',
  // 抓瘸爪踹刷耍
  ya = 'ya',
  // 坡歌母多脱坐
  o = 'o',
  // 脚学雀削略弱
  io = 'io',
  // 车蛇去白北格
  ə = 'ə',
  // 铁冶借些别业
  ie = 'ie',
  // 国
  uə = 'uə',
  // 月靴缺说决热
  ye = 'ye',
  // 胎排彩盖在鞋
  ai = 'ai',
  // 乖怪快块外拐
  uai = 'uai',
  // 衰甩帅揣转
  yai = 'yai',
  // 杯雷嘴醉推灰
  ei = 'ei',
  // 规亏跪柜胃味
  uei = 'uei',
  // 追锤吹水税锐
  yei = 'yei',
  // 包桃考照草胶
  au = 'au',
  // 标条小叫苗腰
  iau = 'iau',
  // 都绸土助走读
  əu = 'əu',
  // 丢流酒救牛秋
  iəu = 'iəu',
  // 端盘管半乱满
  õ = 'õ',
  // 沾缠展战善扇
  ə̃ = 'ə̃',
  // 天棉脸线肩演
  iẽ = 'iẽ',
  // 专船犬怨穿传
  yẽ = 'yẽ',
  // 班谈长尚岸抗
  an = 'an',
  // 江强奖象样谅
  ian = 'ian',
  // 关广狂矿万黄
  uan = 'uan',
  // 庄床闯壮赚涮
  yan = 'yan',
  // 分门等寸硬恨
  ən = 'ən',
  // 兵民顶进定幸
  in = 'in',
  // 昆文捆棍问困
  uən = 'uən',
  // 君群准训顺刃
  yn = 'yn',
  // 东朋猛冻共贡
  oŋ = 'oŋ',
  // 兄穷勇嗅用镕
  ioŋ = 'ioŋ',
  // 姆
  m̩ = 'm̩',
  // 你
  n̩ = 'n̩',
}
